In [1]:
import pandas as pd

In [2]:
# Reading the Departments, Employees, and Salaries data from CSV files

In [3]:
departments = pd.read_csv("C:/Users/PC/Downloads/Departments.csv")

In [4]:
employees = pd.read_csv("C:/Users/PC/Downloads/Employees.csv")

In [5]:
salaries = pd.read_csv("C:/Users/PC/Downloads/Salaries.csv")

In [8]:
# Merging the Departments, Employees, and Salaries data based on matching columns
df = pd.merge(departments, employees, left_on='ID', right_on='DEPT_ID')

In [10]:
# Merging the merged data with Salaries data based on matching columns
data = pd.merge(df, salaries, left_on='ID_y', right_on='EMP_ID')

In [11]:
data

     ID_x NAME_x  ID_y   NAME_y  DEPT_ID  EMP_ID  MONTH (YYYYMM)   AMT
0       1     HR     1     Jack        1       1          202207  5000
1       1     HR     1     Jack        1       1          202208  5000
2       1     HR     2     John        1       2          202207  4000
3       1     HR     2     John        1       2          202208  4000
4       1     HR    10  Shirley        1      10          202207  4800
..    ...    ...   ...      ...      ...     ...             ...   ...
166     5  Sales    16   Howard        5      16          202305  7500
167     5  Sales    16   Howard        5      16          202306  7500
168     5  Sales    21    Bruce        5      21          202304  4800
169     5  Sales    21    Bruce        5      21          202305  4800
170     5  Sales    21    Bruce        5      21          202306  4800

[171 rows x 8 columns]

In [14]:
# Grouping the data by 'NAME_x' (department name) and calculate the mean of 'AMT' (salary)
x = data.groupby(['NAME_x']).agg(DEPT_NAME=('NAME_x', 'first'), AVG_MONTHLY_SALARY=('AMT', 'mean'))

In [17]:
# Sorting the average salaries in descending order
x = x.sort_values(by='AVG_MONTHLY_SALARY', ascending=False)

In [20]:
# Resetting the index to remove the row index label
x = x.reset_index(drop=True)

In [22]:
# Retrieve the top 3 departments with the highest average salaries
top_3_departments = x.head(3)

In [23]:
print(top_3_departments)

  DEPT_NAME  AVG_MONTHLY_SALARY
0     Sales          7045.16129
1       Ops          6420.00000
2   Finance          6360.31746